In [2]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\deepak.thakur\anaconda3\lib\site-packages (8.0.24)
Requirement already satisfied: protobuf>=3.0.0 in c:\users\deepak.thakur\anaconda3\lib\site-packages (from mysql-connector-python) (3.17.0)
Requirement already satisfied: six>=1.9 in c:\users\deepak.thakur\anaconda3\lib\site-packages (from protobuf>=3.0.0->mysql-connector-python) (1.15.0)

In [10]:
import mysql.connector as connection

try:
    mydb = connection.connect(host="localhost",user="root", passwd="root",use_pure=True)
    # check if the connection is established

    query = "SHOW DATABASES"

    cursor = mydb.cursor() #create a cursor to execute queries
    cursor.execute(query)
    print(cursor.fetchall())
    

except Exception as e:
    mydb.close()
    print(str(e))

[('information_schema',), ('mobileqa',), ('mysql',), ('performance_schema',), ('sakila',), ('sys',), ('world',)]

In [4]:
import mysql.connector as connection

In [20]:
conn = connection.connect(host="localhost",user="root", passwd="root",use_pure=True)

In [21]:
cur = conn.cursor()

In [22]:
cur.execute("show databases")

In [23]:
res = cur.fetchall()

In [24]:
res

[('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('world',)]

In [25]:
res[0]

('information_schema',)

In [28]:
for i in res:
    print(i)

('information_schema',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('world',)

In [29]:
# to create a database

In [30]:
conn = connection.connect(host="localhost",user="root", passwd="root",use_pure=True)

In [31]:
cur = conn.cursor()

In [32]:
cur.execute("create database Deepak1234")

In [33]:
cur.fetchall()

[]

In [ ]:
import mysql.connector as connection

try:
    mydb = connection.connect(host="localhost",user="root", passwd="root",use_pure=True)
    # check if the connection is established

    query = "create databases Deepak1234"

    cursor = mydb.cursor() #create a cursor to execute queries
    cursor.execute(query)
    print(cursor.fetchall())

except Exception as e:
    mydb.close()
    print(str(e))

In [ ]:
#to create tables in databases

In [35]:
mydb = connection.connect(host="localhost",database = 'Deepak1234', user="root", passwd="root",use_pure=True)

In [36]:
mydb.is_connected()

True

In [37]:
cur = mydb.cursor()
cur.execute("create table test(x1 INT(5), x2 VARCHAR(20), x3 DATE)")

In [38]:
mydb.close()

In [39]:
#insert data in tables

In [58]:
mydb = connection.connect(host="localhost",database = 'Deepak1234', user="root", passwd="root",use_pure=True)

In [41]:
mydb.is_connected()

True

In [44]:
cur = mydb.cursor()
cur.execute("insert into test values(4655, 'deep', '2021-05-15')")

In [45]:
mydb.commit()

In [46]:
cur.execute("insert into test values(6778, 'deep2', '2021-05-15')")

In [47]:
mydb.commit()

In [48]:
cur.execute("insert into test values(6778, 'deep2', '2021-05-15')")
cur.execute("insert into test values(6778, 'deep2', '2021-05-15')")
cur.execute("insert into test values(6778, 'deep2', '2021-05-15')")
cur.execute("insert into test values(6778, 'deep2', '2021-05-15')")
cur.execute("insert into test values(6778, 'deep2', '2021-05-15')")
cur.execute("insert into test values(6778, 'deep2', '2021-05-15')")
cur.execute("insert into test values(6778, 'deep2', '2021-05-15')")
cur.execute("insert into test values(6778, 'deep2', '2021-05-15')")
cur.execute("insert into test values(6778, 'deep2', '2021-05-15')")
cur.execute("insert into test values(6778, 'deep2', '2021-05-15')")
cur.execute("insert into test values(6778, 'deep2', '2021-05-15')")
cur.execute("insert into test values(6778, 'deep2', '2021-05-15')")
cur.execute("insert into test values(6778, 'deep2', '2021-05-15')")

In [49]:
mydb.commit()

In [59]:
cur = mydb.cursor()
cur.execute("select * from test")

In [60]:
res = cur.fetchall()

In [61]:
res

[(4655, 'deep', None),
 (4655, 'deep', datetime.date(2021, 5, 15)),
 (6778, 'deep2', datetime.date(2021, 5, 15)),
 (6778, 'deep2', datetime.date(2021, 5, 15)),
 (6778, 'deep2', datetime.date(2021, 5, 15)),
 (6778, 'deep2', datetime.date(2021, 5, 15)),
 (6778, 'deep2', datetime.date(2021, 5, 15)),
 (6778, 'deep2', datetime.date(2021, 5, 15)),
 (6778, 'deep2', datetime.date(2021, 5, 15)),
 (6778, 'deep2', datetime.date(2021, 5, 15)),
 (6778, 'deep2', datetime.date(2021, 5, 15)),
 (6778, 'deep2', datetime.date(2021, 5, 15)),
 (6778, 'deep2', datetime.date(2021, 5, 15)),
 (6778, 'deep2', datetime.date(2021, 5, 15)),
 (6778, 'deep2', datetime.date(2021, 5, 15)),
 (6778, 'deep2', datetime.date(2021, 5, 15))]

In [65]:
for i in res:
    print(i[2])

None
2021-05-15
2021-05-15
2021-05-15
2021-05-15
2021-05-15
2021-05-15
2021-05-15
2021-05-15
2021-05-15
2021-05-15
2021-05-15
2021-05-15
2021-05-15
2021-05-15
2021-05-15

In [66]:
cur = mydb.cursor()
cur.execute("select x1, x2 from test")

In [67]:
for i in cur.fetchall():
    print(i)

(4655, 'deep')
(4655, 'deep')
(6778, 'deep2')
(6778, 'deep2')
(6778, 'deep2')
(6778, 'deep2')
(6778, 'deep2')
(6778, 'deep2')
(6778, 'deep2')
(6778, 'deep2')
(6778, 'deep2')
(6778, 'deep2')
(6778, 'deep2')
(6778, 'deep2')
(6778, 'deep2')
(6778, 'deep2')

In [68]:
import pandas as pd

In [69]:
mydb

In [70]:
pd.read_sql("select * from deepak1234.test", mydb)

      x1     x2          x3
0   4655   deep        None
1   4655   deep  2021-05-15
2   6778  deep2  2021-05-15
3   6778  deep2  2021-05-15
4   6778  deep2  2021-05-15
5   6778  deep2  2021-05-15
6   6778  deep2  2021-05-15
7   6778  deep2  2021-05-15
8   6778  deep2  2021-05-15
9   6778  deep2  2021-05-15
10  6778  deep2  2021-05-15
11  6778  deep2  2021-05-15
12  6778  deep2  2021-05-15
13  6778  deep2  2021-05-15
14  6778  deep2  2021-05-15
15  6778  deep2  2021-05-15

In [71]:
pd.read_sql("select x1, x2 from deepak1234.test", mydb)

      x1     x2
0   4655   deep
1   4655   deep
2   6778  deep2
3   6778  deep2
4   6778  deep2
5   6778  deep2
6   6778  deep2
7   6778  deep2
8   6778  deep2
9   6778  deep2
10  6778  deep2
11  6778  deep2
12  6778  deep2
13  6778  deep2
14  6778  deep2
15  6778  deep2

In [72]:
pd.read_sql("select x1,x2,x3 from deepak1234.test", mydb)

      x1     x2          x3
0   4655   deep        None
1   4655   deep  2021-05-15
2   6778  deep2  2021-05-15
3   6778  deep2  2021-05-15
4   6778  deep2  2021-05-15
5   6778  deep2  2021-05-15
6   6778  deep2  2021-05-15
7   6778  deep2  2021-05-15
8   6778  deep2  2021-05-15
9   6778  deep2  2021-05-15
10  6778  deep2  2021-05-15
11  6778  deep2  2021-05-15
12  6778  deep2  2021-05-15
13  6778  deep2  2021-05-15
14  6778  deep2  2021-05-15
15  6778  deep2  2021-05-15

In [76]:
 pd.read_sql("select x1,x1,x1 from deepak1234.test", mydb)

      x1    x1    x1
0   4655  4655  4655
1   4655  4655  4655
2   6778  6778  6778
3   6778  6778  6778
4   6778  6778  6778
5   6778  6778  6778
6   6778  6778  6778
7   6778  6778  6778
8   6778  6778  6778
9   6778  6778  6778
10  6778  6778  6778
11  6778  6778  6778
12  6778  6778  6778
13  6778  6778  6778
14  6778  6778  6778
15  6778  6778  6778

TypeError: to_sql() missing 2 required positional arguments: 'name' and 'con'

In [77]:
import mysql.connector as connection
import pandas as pandas
import csv
mydb = connection.connect(host="localhost", user="root", passwd="root",use_pure=True)

In [80]:
cur = mydb.cursor()
cur.execute("CREATE TABLE deepak1234.glass (Index_Number INT(20), RI float(10,5), Na float(10,5), Mg float(10,5), Al float(10,5), Si float(10,5), k float(10,5), Ca float(10,5), Ba float(10,5), Fe float(10,5),class INT(5))")

In [ ]:
# to insert dat from external file in deepak1234.glass

In [83]:
with open('glass', "r") as data:
    data_csv = csv.reader(data, delimiter = "\n")
    print(data_csv)
    for i in enumerate(data_csv):
        print(i)
        for j in i[1]:
            cur.execute('insert into deepak1234.glass values ({data})'.format(data=(j)))
    print("all the data inserted")
mydb.commit()

FileNotFoundError: [Errno 2] No such file or directory: 'glass'

In [ ]:
# https://archive.ics.uci.edu/ml/datasets/Carbon+Nanotubes
#https://archive.ics.uci.edu/ml/machine-learning-databases/00448/